In [1]:
# Pandas is most commonly used for data wrangling and data manipulation purposes
# NumPy is a fundamental library for numerical computing in Python.Mathematical Operations, Arrays,Linear Algebra etc
#Removing Duplicates
#Fixing NULL values(Age, Department)
#Standardization of each value(Gender)
#Concatenate First Name and Last Name
#Add a new column(YearsAtCompany)
#STrength by Maritial Status

In [40]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns
from datetime import datetime

In [63]:
pd.reset_option('display.max_rows',None)
df = pd.read_csv("Sample_HR.csv")

# df = df.shape
# print(f"No of rows {df}")

# df = df[df.duplicated()].shape[0]

df = df.drop_duplicates()

df.shape

# df =  df[df["Age"].isnull()]
avg_age =  int(df["Age"].mean())

df["Age"] = df["Age"].fillna(avg_age)
df["Department"] = df["Department"].fillna("Data Engineering")


df['Gender'] = df["Gender"].replace({"M":"Male","F":"Female"})


df["Name"] = df["First Name"] + ' ' + df["Last Name"]


columns = df.columns.tolist()
last_name_index = columns.index('Last Name')
columns.insert(last_name_index + 1, columns.pop(columns.index('Name')))
df = df[columns]
df = df.rename( columns = {'Name':'Full Name'})

# Get number of experience
hire_date = pd.to_datetime(df['Hire_Date']).dt.year
current_year = datetime.now().year
df['YearAtCompany'] = current_year - hire_type

columns  = df.columns.tolist()
department_index  = columns.index("Department")
columns.insert(department_index + 1,columns.pop(columns.index("YearsAtCompany")) )
df = df[columns]

In [65]:
df

,Employee_ID,First Name,Last Name,Full Name,Gender,MaritalStatus,Department,YearsAtCompany,Grade,Employee_Count,...,MonthlyRate,Age,Job Type,Job Experience,Hire_Date,Company_Environment,TrainingTimesLastYear,WorkLifeBalance,Country,YearAtCompany
0,1,Shelia,Mahoney,Shelia Mahoney,Male,Single,Sales,6,2,1,...,19479,41.0,Permannent,16,1/1/2010,5,0,1,United Kingdom,2010
1,2,Jo,Rivers,Jo Rivers,Female,Married,TECH,10,2,1,...,24907,49.0,Contractual,14,2/1/2012,3,3,3,United States,2012
2,3,Sheryl,Lowery,Sheryl Lowery,Female,Single,TECH,0,1,1,...,2396,37.0,Contractual,14,2/2/2012,4,3,3,Australia,2012
3,4,Whitney,Hooper,Whitney Hooper,Male,Married,TECH,8,1,1,...,23159,33.0,Contractual,14,2/3/2012,4,3,3,Australia,2012
4,5,Lindsey,Rice,Lindsey Rice,Female,Married,Manfacturing,2,1,1,...,16632,27.0,Contractual,14,2/4/2012,1,3,3,Australia,2012
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1497,1466,Shelley,Benjamin,Shelley Benjamin,Male,Married,Data Engineering,5,2,1,...,12290,36.0,Contractual,8,2/1/2019,3,3,3,France,2019
1498,1467,Isaiah,Jarvis,Isaiah Jarvis,Male,Married,Data Engineering,7,3,1,...,21457,39.0,Contractual,8,2/2/2019,5,5,3,France,2019
1499,1468,Nathan,Sutton,Nathan Sutton,Female,Married,Data Engineering,6,2,1,...,5174,27.0,Contractual,8,2/3/2019,2,0,3,France,2019
1500,1469,Earl,Mccullough,Earl Mccullough,Female,Married,Sales,9,2,1,...,13243,49.0,Contractual,8,2/4/2019,4,3,2,France,2019
1501,1470,Alan,Mcdaniel,Alan Mcdaniel,Female,Married,Data Engineering,4,2,1,...,10228,34.0,Contractual,8,2/5/2019,5,3,4,France,2019